{"meta":{"title":"Hexo","subtitle":"","description":"","author":"John Doe","url":"http://example.com","root":"/"},"pages":[],"posts":[{"title":"交易体系的基础逻辑","slug":"Num001","date":"2023-02-08T08:08:38.934Z","updated":"2023-02-08T08:39:30.001Z","comments":true,"path":"2023/02/08/Num001/","link":"","permalink":"http://example.com/2023/02/08/Num001/","excerpt":"","text":"交易体系的基础逻辑专注价格行为上的生存，时间不会特别长，就会遇到“交易系统”。朋友的善意提醒，书本的直面灌输，和无目的的自发思考，都是触达“交易系统”这个模块的可能方式。 最直接的驱动是自问，不能再这么下去了，得有一套“东西”。来自自发直觉的思考和觉醒，往往最有效，也最痛切。不难想象，在此之前，经历了什么。 需要明白，这是针对什么的系统？交易、投资、投机之间是否有真正的分界线？ 在这个行业中，有道德至上者，有科技、价值等多方面的原教旨主义者，也有随机漫步游走者；他们却有共同的特点，就是长期来看，自己是战胜市场且绝对成功的。如果是战胜市场，但是亏损，就不算成功。 以此为标准，那下面这个问题就无法证伪，即，“你怎么能证明你不是交易周期”？又如何证明巴菲特不是站在康德拉季耶夫周期的上升期？ 反过来，进一步，一个基本的假设就是，以周期作为主干，构建策略的可能性是有的。作为主干的基本要素，无论是周期大小，也无论是股票、期货、外汇等市场，也不区别人类的群体划分，都应该是相同的。 唯一区别的就是系统的使用者——交易者自己。 另一方面，系统也是千人千面；如果把交易者自己归入到系统中，那么每个交易系统都不一样。A的系统，B用不了；B的系统，是C失败的直接原因，甚至是D的对手盘。 有了上述的认识，在认知层面上，至少有两个基本理念： 技术分析、基本面分析、价值判断，从根本上来说，没有区别；都只是各自的践行者在自己所遵行的系统中找一个明确的行为标准，且各自有各自的命运。 放弃从别人手中求得圣杯甚至是夺得圣杯的执念，有无圣杯只掌握在自己的手中。他人的刀用不好是会伤了自己的。 但是还是有一些要素，能拿来讨论的，如： 一套系统的构成？ 如何鉴定这套系统适合不适合自己？ 回测有效的系统使用不了的原因？ 系统阶段性的失效，是否该调整，如何调整？ 多系统的嵌套有无可能？等等 以开放的心态和理念，接下来所谈论的内容无绝对真与伪，皆是属于某一个话语体系中的“你来我往”。有时候，只是为了“你来我往”，才会产生那些烂大街的流行语和名词。流行到什么程度呢，比如，对某些K线组合和指标与K线的分布关系，换一个名词，都可以出一本书的。 以结果论行为，是有一套理论和话术的，如都知道的盈亏比、胜率、破产率等。那么一个简单的系统模型框架就出来了。 一个胜率为40%、盈亏比为2、基本止损单位为初始资金规模的1%，那么在交易100次之后的总体收益是20%。 在固定止损规模和交易次数的情况下，胜率、盈亏比与整体收益率的矩阵如下： 从表中可以看到，在盈亏比为3胜率40%情况下，最终的交易收益率为60%。 至于这100次交易多久能完成，就具体市场具体论，同一市场具体品种具体论。如果这个60%是目标的话，多久能达到，交易者自己就只能以预期选择市场和品种了。事情进而有了进一步走下去的可能性。 这个简单模型同时也是用来理解各类风格的基本框架；如VC、PE、定增的关系，皆无明确界限，只是盈亏比、胜率和机会的区别。 巴菲特先生成为神的原因，就是在胜率和盈亏比两个方面都做到极限，但是放弃的是机会，看不懂不做；彼得林奇则是另一个极端，他利用二级市场做VC投资，追求机会和盈亏比，放弃的是胜率；国内市场Pre-IPO的投资，则追求的是胜率和机会，放弃的是盈亏比，基本模型是按照市值差异、上市时间、稀释比例框定一个能说得过去的收益，就可以开干。 技术交易群体中，趋势交易、波段交易、刮头皮交易，大概也是这个区别。至于选择哪一种，能不能执行到位，就需要自我评估了。 在这几个要素框定下，制定出一系列的中观原则，包括市场选择、品种选择，交易周期，交易频率，开仓信号，止损止盈规则，是否加仓规则，同一时间是否允许交叉等。 列出这些要素之后，回测，模拟，可以采用代码化的方式，也可以采用人工的方式；模拟和回测的目的，是论证整体系统是否正向，而非具体的收益率大小。这一步要解决的是，让自己至少走在正确的方向上。 在有了明确的开平仓信号之后，需要的就是简化和优化工作。 这两个步骤是一体，强调的是优化的过程不是加法，而是减法，至于为什么要这样做，权威的回答者很多。有人会推出中国传统文化，有人会推出克罗的“KISS”准则。都是可以的。 其基本逻辑是这样的，只有简化才能模型优化，否则就会产生归因的多要素陷阱；也只有简化才能行为优化，因为毕竟交易是人做的，量化系统也是人来调整的，不简化，人的能动性就贡献不足。 清晰的交易系统构建完成且验证有效之后，经过简化优化，接下来就是训练。书面一点说，训练就是为了能真正将“人”这个主体全面纳入到系统中，如果做不到这一点，系统也就不是系统，没有生命力。 这也是无数交易者、投资者折戟的一步。 拿投资来说，大的机构有了清晰的投资战略和策略，且在市场一致追捧的情况下，企业文化偏移，市场热度大增时大量定增；无法拒绝资金，也无法拒绝机会。这就是管理机构和它自己的系统产生的分裂。 交易者也一样，长时间平平稳稳的交易，不抵一次的放纵、重仓、扛单。利弗莫尔之剑也长悬高空。 总结来说，分析自己和自己的团队，才是构建交易系统的前提、践行交易系统的根本。 修心密钥，就是不盲目修心。","categories":[],"tags":[]},{"title":"Hello World","slug":"hello-world","date":"2023-02-08T06:44:05.483Z","updated":"2023-02-08T06:44:05.483Z","comments":true,"path":"2023/02/08/hello-world/","link":"","permalink":"http://example.com/2023/02/08/hello-world/","excerpt":"","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","categories":[],"tags":[]}],"categories":[],"tags":[]}